Revit 2027 API
AnalysisDisplayLegendSettings.IsEqual Method
 Compares two legend settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayLegendSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayLegendSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayLegendSettings^ other
)
member IsEqual :
        other : AnalysisDisplayLegendSettings -> bool
Parameters
other AnalysisDisplayLegendSettings
 Legend settings object to compare to.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace